cr1901/msp430g2xx/svds/msp430g2x21.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CALIBRATION_DATA</name>
      <description>Calibration Data</description>
      <baseAddress>4350</baseAddress>
      <registers>
        <register>
          <name>CALDCO_1MHZ</name>
          <description>DCOCTL  Calibration Data for 1MHz</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALDCO_1MHZ</name>
              <description>DCOCTL  Calibration Data register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CALBC1_1MHZ</name>
          <description>BCSCTL1 Calibration Data for 1MHz</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CALBC1_1MHZ</name>
              <description>BCSCTL1 Calibration Data register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WATCHDOG_TIMER</name>
      <description>Watchdog Timer</description>
      <baseAddress>288</baseAddress>
      <registers>
        <register>
          <name>WDTCTL</name>
          <description>Watchdog Timer Control</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>WDTSSEL</name>
              <description>WDTSSEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTCNTCL</name>
              <description>WDTCNTCL</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTTMSEL</name>
              <description>WDTTMSEL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTNMI</name>
              <description>WDTNMI</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTNMIES</name>
              <description>WDTNMIES</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTHOLD</name>
              <description>WDTHOLD</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTPW</name>
              <description>Watchdog Timer Password</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>WDTPWR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>PASSWORD</name>
                  <description>Value always read from the Watchdog Password register</description>
                  <value>105</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>WDTPWW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>PASSWORD</name>
                  <description>Value which must be written to the Watchdog Password register</description>
                  <value>90</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTIS</name>
              <description>WDTIS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>Flash</description>
      <baseAddress>296</baseAddress>
      <registers>
        <register>
          <name>FCTL1</name>
          <description>FLASH Control 1</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ERASE</name>
              <description>Enable bit for Flash segment erase</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MERAS</name>
              <description>Enable bit for Flash mass erase</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRT</name>
              <description>Enable bit for Flash write</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLKWRT</name>
              <description>Enable bit for Flash segment write</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FWKEY</name>
              <description>FCTL1 Password</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>FWKEYR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>PASSWORD</name>
                  <description>Value always read from the FCTL1 Password register</description>
                  <value>150</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>FWKEYW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>PASSWORD</name>
                  <description>Value which must be written to the FCTL1 Password register</description>
                  <value>165</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTL2</name>
          <description>FLASH Control 2</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>FSSEL</name>
              <description>Flash clock select 0 */        /* to distinguish from USART SSELx</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSSEL_0</name>
                  <description>Flash clock select: 0 - ACLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSSEL_1</name>
                  <description>Flash clock select: 1 - MCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSSEL_2</name>
                  <description>Flash clock select: 2 - SMCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSSEL_3</name>
                  <description>Flash clock select: 3 - SMCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWKEY</name>
              <description>FCTL2 Password</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>FWKEYR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>PASSWORD</name>
                  <description>Value always read from the FCTL2 Password register</description>
                  <value>150</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>FWKEYW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>PASSWORD</name>
                  <description>Value which must be written to the FCTL2 Password register</description>
                  <value>165</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FN</name>
              <description>Divide Flash clock by 1 to 64 using FN0 to FN5 according to:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTL3</name>
          <description>FLASH Control 3</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Flash busy: 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYV</name>
              <description>Flash Key violation flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACCVIFG</name>
              <description>Flash Access violation flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT</name>
              <description>Wait flag for segment write</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock bit: 1 - Flash is locked (read only)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMEX</name>
              <description>Flash Emergency Exit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKA</name>
              <description>Segment A Lock bit: read = 1 - Segment is locked (read only)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAIL</name>
              <description>Last Program or Erase failed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FWKEY</name>
              <description>FCTL3 Password</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>FWKEYR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>PASSWORD</name>
                  <description>Value always read from the FCTL3 Password register</description>
                  <value>150</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>FWKEYW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>PASSWORD</name>
                  <description>Value which must be written to the FCTL3 Password register</description>
                  <value>165</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
